test/dummy/app/controllers/posts_controller.rb

  def index
    @posts = Post.page(current_page, 2)
---
SELECT "posts".* FROM "posts" LIMIT 2 OFFSET 0